import { MenuItem } from "./types";

export const slidesData = [
  {
    theme: "Наука",
    content: [
      {
        title: "1905",
        content: "Альберт Эйнштейн публикует теорию относительности.",
      },
      { title: "1928", content: "Александр Флеминг открывает пенициллин." },
      { title: "1952", content: "Создан первый термоядерный реактор." },
      { title: "1965", content: "Открыто реликтовое излучение в космосе." },
      { title: "1974", content: "Обнаружен скелет австралопитека Люси." },
      {
        title: "1996",
        content: "Запуск телескопа Хаббл открыл новые горизонты во Вселенной.",
      },
    ],
  },
  {
    theme: "История",
    content: [
      { title: "1789", content: "Начало Французской революции." },
      { title: "1914", content: "Начало Первой мировой войны." },
      { title: "1939", content: "Начало Второй мировой войны." },
      {
        title: "1963",
        content: "Марш за гражданские права в Вашингтоне (Мартин Лютер Кинг).",
      },
      { title: "1989", content: "Падение Берлинской стены." },
      { title: "2001", content: "Теракты 11 сентября в США." },
    ],
  },
  {
    theme: "Технологии",
    content: [
      { title: "1876", content: "Александр Белл изобретает телефон." },
      {
        title: "1903",
        content: "Братья Райт совершают первый полёт на самолёте.",
      },
      { title: "1947", content: "Создан первый транзистор." },
      { title: "1971", content: "Изобретён первый микропроцессор Intel 4004." },
      {
        title: "1989",
        content: "Тим Бернерс-Ли создаёт прототип World Wide Web.",
      },
      { title: "2007", content: "Apple выпускает первый iPhone." },
    ],
  },
  {
    theme: "Культура",
    content: [
      {
        title: "1605",
        content: "Опубликован роман Мигеля де Сервантеса «Дон Кихот».",
      },
      { title: "1827", content: "Последний концерт Людвига ван Бетховена." },
      { title: "1889", content: "Открытие Эйфелевой башни в Париже." },
      { title: "1922", content: "Обнаружение гробницы фараона Тутанхамона." },
      { title: "1969", content: "Фестиваль Вудсток в США." },
      { title: "2010", content: "Открытие музея Лувр-Абу-Даби." },
    ],
  },
  {
    theme: "Рекорды",
    content: [
      {
        title: "1954",
        content: "Роджер Бэннистер пробегает милю менее чем за 4 минуты.",
      },
      {
        title: "1960",
        content: "Самое глубокое погружение — батискаф «Триест».",
      },
      {
        title: "2008",
        content:
          "Усэйн Болт устанавливает мировой рекорд на 100 метров (9,69 с).",
      },
      { title: "2012", content: "Феликс Баумгартнер прыгает со стратосферы." },
      {
        title: "2021",
        content: "Самое быстрое электромобильное ускорение — Tesla Plaid.",
      },
    ],
  },
  {
    theme: "Экспедиции",
    content: [
      { title: "1492", content: "Христофор Колумб достигает берегов Америки." },
      { title: "1519", content: "Начало кругосветного путешествия Магеллана." },
      { title: "1773", content: "Джеймс Кук пересекает Антарктический круг." },
      { title: "1911", content: "Руаль Амундсен достигает Южного полюса." },
      { title: "1953", content: "Покорение Эвереста Хиллари и Норгеем." },
      {
        title: "1960",
        content: "Погружение батискафа «Триест» на дно Марианской впадины.",
      },
    ],
  },
];

export const menuItems: MenuItem[] = [
  { id: 1, title: "Наука" },
  { id: 2, title: "История" },
  { id: 3, title: "Технологии" },
  { id: 4, title: "Культура" },
  { id: 5, title: "Рекорды" },
  { id: 6, title: "Экспедиции" },
];
